docs: restructure README
